base/Documents/бит_му_ПринятиеКУчетуНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_ПринятиеКУчетуНМА</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_му_СостоянияНМА</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>InformationRegister.бит_му_ПараметрыНМА</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНРП</Name>
					<Comment>Счет нераспределенной прибыли</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НематериальныеАктивы</Name>
					<Comment>Нематериальные активы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НематериальныйАктив</Name>
							<Comment>Нематериальный актив</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Comment>Класс нематериального актива</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_му_КлассыНМА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПринятияКУчету</Name>
							<Comment>Дата принятия к учету</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Comment>Срок полезного использования</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимость</Name>
							<Comment>Первоначальная стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислятьАмортизацию</Name>
							<Comment>Начислять амортизацию</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислятьАмортизациюСТекущегоПериода</Name>
							<Comment>Начислять амортизацию с текущего периода</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодНачисленияАмортизации</Name>
							<Comment>Метод начисления амортизации</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизацииНМА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисленнойАмортизации</Name>
							<Comment>Сумма начисленной амортизации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияРасходовПоАмортизации</Name>
							<Comment>Способ отражения расходов по амортизации</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_му_СпособыОтраженияРасходовПоАмортизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентУскорения</Name>
							<Comment>Коэффициент ускорения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНачисленияАмортизации</Name>
							<Comment>Счет начисления амортизации</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредполагаемыйОбъемПродукции</Name>
							<Comment>Предполагаемый объем продукции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияОбъемаПродукции</Name>
							<Comment>Ед. изм. объема продукции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРезерваПереоценки</Name>
							<Comment>Счет резерва переоценки</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСниженияСтоимости</Name>
							<Comment>Счет снижения стоимости</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>Аналитика счета учета 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>Аналитика счета учета 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>Аналитика счета учета 3</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто4</Name>
							<Comment>Аналитика счета учета 4</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСчет</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто1</Name>
							<Comment>Аналитика кор счета 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто2</Name>
							<Comment>Аналитика кор счета 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто3</Name>
							<Comment>Аналитика кор счета 3</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто4</Name>
							<Comment>Аналитика кор счета 4</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Enums/бит_му_РежимыПодбораВНА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_РежимыПодбораВНА</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчетуОС</Name>
					<Comment>Принятие к учету ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводНачальныхОстатковОС</Name>
					<Comment>Ввод начальных остатков ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеОС</Name>
					<Comment>Перемещение ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодернизацияОС</Name>
					<Comment>Модернизация ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеАмортизацииОС</Name>
					<Comment>Начисление амортизации ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеАмортизацииНМА</Name>
					<Comment>Начисление амортизации НМА</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыработкаОС</Name>
					<Comment>Выработка ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбесценениеОС</Name>
					<Comment>Обесценение ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаОС</Name>
					<Comment>Переоценка ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеОС</Name>
					<Comment>Выбытие ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчетуНМА</Name>
					<Comment>Принятие к учету НМА</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеНМА</Name>
					<Comment>Выбытие НМА</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыработкаНМА</Name>
					<Comment>Выработка НМА</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаНМА</Name>
					<Comment>Переоценка НМА</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбесценениеНМА</Name>
					<Comment>Обесценение НМА</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводОСВСоставИнвестиционнойСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчетуОСПоОстаткам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчетуНМАПоОстаткам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_му_ПринятиеКУчетуНМА/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция получает параметры, передаваемые в обработку подбора ОС.
//
Функция ЗаполнитьПараметрыПодбора(Объект) Экспорт
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе"	, Ложь);
	ПараметрыПодбора.Вставить("Организация"			, Объект.Организация);                             
	ПараметрыПодбора.Вставить("Режим"				, Перечисления.бит_му_РежимыПодбораВНА.ПринятиеКУчетуНМА);
	ПараметрыПодбора.Вставить("ДатаНачала"			, НачалоМесяца(Объект.Дата));
	ПараметрыПодбора.Вставить("ДатаОкончания"		, КонецМесяца(Объект.Дата));
	ПараметрыПодбора.Вставить("ВалютаДокумента"		, Объект.ВалютаДокумента);

	Возврат ПараметрыПодбора;
	
КонецФункции // ЗаполнитьПараметрыПодбора()

Процедура ЗаполнитьНМА(ВыбранноеЗначение, Объект) Экспорт 
	
	ОписаниеТаблицы  = ВыбранноеЗначение.Данные;
	ТаблицаДанных    = бит_ОбщегоНазначения.РаспаковатьТаблицуИзМассива(ОписаниеТаблицы.ПереченьОбъектов,ОписаниеТаблицы.ПереченьОбъектов_Колонки);
	УчетнаяПолитикаМСФО = бит_му_ОбщегоНазначения.ПолучитьУчетнуюПолитику(Объект.Дата, Новый Структура("Организация", Объект.Организация));

	Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("НематериальныйАктив", СтрокаТаблицы.ВНА);
		
		МассивСтрок = Объект.НематериальныеАктивы.НайтиСтроки(СтруктураОтбора);
		
		Если МассивСтрок.Количество() = 0 Тогда
			НайденнаяСтрока = Неопределено;
		Иначе
			НайденнаяСтрока = МассивСтрок[0];
		КонецЕсли;
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			НоваяСтрока = Объект.НематериальныеАктивы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			НоваяСтрока.НематериальныйАктив        = СтрокаТаблицы.ВНА;
			НоваяСтрока.НачислятьАмортизацию       = Истина;
			НоваяСтрока.МетодНачисленияАмортизации = Перечисления.бит_му_МетодыНачисленияАмортизацииНМА.Линейный;
			
			НоваяСтрока.НачислятьАмортизациюСТекущегоПериода = бит_ОбщегоНазначения.НастройкаПрограммы(
				УчетнаяПолитикаМСФО, ПланыВидовХарактеристик.бит_му_ВидыПараметровУчетнойПолитики.НачислятьАмортизациюСТекущегоПериодаНМА);
											
			Объект.ЗаполнитьКлассПоУмолчаниюМодуль(НоваяСтрока);
			
			// Выполним подбор счетов.
			ВыполнитьПодборСчетов(НоваяСтрока, СтрокаТаблицы, Объект);
			
		Иначе
			
			ТекстСообщения = НСтр("ru='Нематериальный актив ""%1"" уже подобран в строке №%2.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.ВНА, НайденнаяСтрока.НомерСтроки);				 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли; 
		
	КонецЦикла; // По строкам таблицы данных
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьПодборСчетов(НоваяСтрока, СтрокаТаблицы, Объект)
	
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.СчетКт) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = бит_му_ОбщегоНазначения.ПодготовитьСтруктуруПараметровДляПодбораСчетовМУ(Объект.Организация, Объект.Дата);
	
	///////////////////////////////////////////////////////////////////////////////
	// Заполним счета и аналитику новой строки.
	
	НаборИсточник = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборПриемник = РегистрыБухгалтерии.бит_Дополнительный_2.СоздатьНаборЗаписей();
	
	// Заполним набор записей источник по строке таблицы значений.
	ЗаписьИсточник = НаборИсточник.Добавить();
	ЗаписьИсточник.СчетДт = СтрокаТаблицы.СчетДт;
	ЗаписьИсточник.СчетКт = СтрокаТаблицы.СчетКт;
	
	// Заполним аналитику счета Дт и Кт.
	бит_му_ОбщегоНазначения.ЗаполнитьАналитикуДт_Кт(ЗаписьИсточник, СтрокаТаблицы, "СубконтоДт", "СубконтоКт", 3);
	
	ПротоколТрансляции = "";
	
	// Выполним подбор счетов по правилам трансляции.
	бит_МеханизмТрансляции.ВыполнитьТрансляциюДвижений(Объект
													  ,НаборИсточник
													  ,НаборПриемник
													  ,СтруктураПараметров
													  ,ПротоколТрансляции);
	Если НаборПриемник.Количество() > 0 Тогда
		
		// Запишем результат подбора счетов в шапку документа.
		ЗаписьПриемник = НаборПриемник[0];
		
		Если ЗначениеЗаполнено(ЗаписьПриемник.СчетДт) Тогда
			
			НоваяСтрока.СчетУчета = ЗаписьПриемник.СчетДт;
			
			// Заполним аналитику счета учета.
			Для Ном = 1 По 4 Цикл
				НоваяСтрока["Субконто" + Ном] = бит_МеханизмТрансляции.ЗначениеСубконто(ЗаписьПриемник, "Дт", Ном);
			КонецЦикла; 
			
			ПриИзмененииСчетаВСтроке(НоваяСтрока, "СчетУчета", "Субконто");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаписьПриемник.СчетКт) Тогда
			
			НоваяСтрока.КорСчет = ЗаписьПриемник.СчетКт;
			
			// Заполним аналитику кор счета.
			Для Ном = 1 По 4 Цикл
				НоваяСтрока["КорСубконто" + Ном] = бит_МеханизмТрансляции.ЗначениеСубконто(ЗаписьПриемник, "Кт", Ном);
			КонецЦикла; 
			
			ПриИзмененииСчетаВСтроке(НоваяСтрока, "КорСчет", "КорСубконто");
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры // ВыполнитьПодборСчетов()

Процедура СинхронизироватьРеквизитыСтрокиНМА(ТекущаяСтрока, ИмяСубконто)
	
	Если ТекущаяСтрока = Неопределено Тогда
		 Возврат;
	КонецЕсли; 

	Если ЗначениеЗаполнено(ТекущаяСтрока.НематериальныйАктив) Тогда
		
		ТипОС = Тип("СправочникСсылка.НематериальныеАктивы");
		
		Для Ном = 1 По 4 Цикл
			
			ТекИмяСубконто = ИмяСубконто + Ном;
			
			Если ТипЗнч(ТекущаяСтрока[ТекИмяСубконто]) = ТипОС Тогда
				 ТекущаяСтрока[ТекИмяСубконто] = ТекущаяСтрока.НематериальныйАктив;
			 КонецЕсли; 
		
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриИзмененииСчетаВСтроке(ТекущиеДанные, РевизитСчет, РеквизитыСубконто)

	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(ТекущиеДанные[РевизитСчет], 4);									  
	бит_БухгалтерскийУчет.ПривестиЗначенияСубконто(ТекущиеДанные, НастройкиСубконто, РеквизитыСубконто);
	
	СинхронизироватьРеквизитыСтрокиНМА(ТекущиеДанные, РеквизитыСубконто);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
